///代入演算子　（値を代入して更新する）

//単純代入：　a = 10;

//複合代入：　（算術型）「+= -= /= *= %= **=」
//複合代入：　（論理型）「||= &&= ??=」

//------------------------------------------------------------------------//

//複合代入：　（算術型）「+= -= /= *= %= **=」

//number型

let x = 10;

x += 5;//15
x -= 3;//12
x *= 2//24


console.log(x);

//string型

let msg = "hello";

msg += "world";

console.log(msg);

//------------------------------------------------------------------------//

//複合代入：　（論理型）「||= &&= ??=」

//①　||= (or)
//falsy値でしたら条件を満たすので、代入を行います

//falsy値：　false, 0, "", null, undefined, NaNじゃないと代入されない

let z = 0;
z ||= 100;
console.log(z);

//②　&&= (and)
//truthy値でしたら条件を満たすので、代入を行います

//truthy値：　true, 数字（０以外）, 文字列（""　これ以外）, 配列, オブジェクト, 関数じゃないと代入されない

let k = true;
k &&= 200;
console.log(k);

//③　??= (nullish) => null//undefinedじゃないと代入されない。

let y = undefined;

y ??= 300;

console.log(y);